# <div align=center>Pandas</div>

In [1]:
import pandas as pd
import numpy as np

## **OBJECT CREATION**

### Creating a Series by passing a list of values, letting pandas create a default integer index

In [2]:
pd.Series([1,3,5,np.nan,6,8])

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

### Creating a DataFrame by passing a numpy array, with a datetime index and labeled columns

In [3]:
dates = pd.date_range('20130101', periods = 6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.829412 -0.488830  1.034144  1.179797
2013-01-02 -0.073559 -0.771695 -2.022051  0.744386
2013-01-03  1.045010 -0.777690 -0.600271 -0.670022
2013-01-04 -0.212901 -0.676578 -2.105190  0.928769
2013-01-05  0.598247 -0.833896  0.392578  0.683457
2013-01-06  0.375194 -1.213800  1.011491 -0.077752

### Creating a DataFrame by passing a dict of objects that can be converted to series-like.

In [5]:
df2 = pd.DataFrame({ 'A' : 1,
                     'B' : pd.Timestamp('20130102'),
                     'C' : pd.Series(1, index=list(range(4)), dtype='float64'),
                     'D' : np.array([3] * 4, dtype='int32'),
                     'E' : pd.Categorical(["test", "train", "test", "train"]),
                     'F' : 'foo' })

df2

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo
3  1 2013-01-02  1.0  3  train  foo

### Having specific dtypes

In [6]:
df2.dtypes

A             int64
B    datetime64[ns]
C           float64
D             int32
E          category
F            object
dtype: object

## __VIEWING DATA__

### See the top and bottom rows of the frame

In [7]:
df.head()

                   A         B         C         D
2013-01-01 -0.829412 -0.488830  1.034144  1.179797
2013-01-02 -0.073559 -0.771695 -2.022051  0.744386
2013-01-03  1.045010 -0.777690 -0.600271 -0.670022
2013-01-04 -0.212901 -0.676578 -2.105190  0.928769
2013-01-05  0.598247 -0.833896  0.392578  0.683457

In [8]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.212901 -0.676578 -2.105190  0.928769
2013-01-05  0.598247 -0.833896  0.392578  0.683457
2013-01-06  0.375194 -1.213800  1.011491 -0.077752

### Displaying the index, columns, and the underlying numpy data

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [11]:
df.values

array([[-0.82941173, -0.48882954,  1.03414405,  1.17979734],
       [-0.07355937, -0.77169493, -2.02205133,  0.74438623],
       [ 1.04501026, -0.77768975, -0.60027124, -0.67002198],
       [-0.21290092, -0.67657752, -2.10519015,  0.92876888],
       [ 0.59824718, -0.83389633,  0.39257767,  0.68345734],
       [ 0.37519443, -1.21380027,  1.01149086, -0.07775207]])

### Describe shows a quick statistic summary of your data

In [12]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.150430 -0.793748 -0.381550  0.464773
std    0.662360  0.238958  1.432065  0.697804
min   -0.829412 -1.213800 -2.105190 -0.670022
25%   -0.178066 -0.819845 -1.666606  0.112550
50%    0.150818 -0.774692 -0.103847  0.713922
75%    0.542484 -0.700357  0.856763  0.882673
max    1.045010 -0.488830  1.034144  1.179797

### Transposing your data

In [13]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.829412   -0.073559    1.045010   -0.212901    0.598247    0.375194
B   -0.488830   -0.771695   -0.777690   -0.676578   -0.833896   -1.213800
C    1.034144   -2.022051   -0.600271   -2.105190    0.392578    1.011491
D    1.179797    0.744386   -0.670022    0.928769    0.683457   -0.077752

### Sorting by values

In [14]:
df.sort_values(by = 'B')

                   A         B         C         D
2013-01-06  0.375194 -1.213800  1.011491 -0.077752
2013-01-05  0.598247 -0.833896  0.392578  0.683457
2013-01-03  1.045010 -0.777690 -0.600271 -0.670022
2013-01-02 -0.073559 -0.771695 -2.022051  0.744386
2013-01-04 -0.212901 -0.676578 -2.105190  0.928769
2013-01-01 -0.829412 -0.488830  1.034144  1.179797

### Sorting by an axis

In [15]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.179797  1.034144 -0.488830 -0.829412
2013-01-02  0.744386 -2.022051 -0.771695 -0.073559
2013-01-03 -0.670022 -0.600271 -0.777690  1.045010
2013-01-04  0.928769 -2.105190 -0.676578 -0.212901
2013-01-05  0.683457  0.392578 -0.833896  0.598247
2013-01-06 -0.077752  1.011491 -1.213800  0.375194

## **SELECTION**

### Selecting a single column, which yields a Series, equivalent to df.A

In [16]:
df['A']

2013-01-01   -0.829412
2013-01-02   -0.073559
2013-01-03    1.045010
2013-01-04   -0.212901
2013-01-05    0.598247
2013-01-06    0.375194
Freq: D, Name: A, dtype: float64

### Selecting via [ ], which slices the rows

In [17]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.829412 -0.488830  1.034144  1.179797
2013-01-02 -0.073559 -0.771695 -2.022051  0.744386
2013-01-03  1.045010 -0.777690 -0.600271 -0.670022

In [18]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.073559 -0.771695 -2.022051  0.744386
2013-01-03  1.045010 -0.777690 -0.600271 -0.670022
2013-01-04 -0.212901 -0.676578 -2.105190  0.928769

## *Selection by label*

### Showing on a multi-axis by label

In [19]:
df.loc[:, ['A','B']]

                   A         B
2013-01-01 -0.829412 -0.488830
2013-01-02 -0.073559 -0.771695
2013-01-03  1.045010 -0.777690
2013-01-04 -0.212901 -0.676578
2013-01-05  0.598247 -0.833896
2013-01-06  0.375194 -1.213800

### For getting a cross section using a label

In [20]:
df.loc[dates[0]]

A   -0.829412
B   -0.488830
C    1.034144
D    1.179797
Name: 2013-01-01 00:00:00, dtype: float64

### Showing label slicing, both endpoints are included

In [21]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.073559 -0.771695
2013-01-03  1.045010 -0.777690
2013-01-04 -0.212901 -0.676578

### Reduction in the dimensions of the returned object

In [22]:
df.loc['20130102',['A','B']]

A   -0.073559
B   -0.771695
Name: 2013-01-02 00:00:00, dtype: float64

### For getting a scalar value

In [23]:
df.loc[dates[0],'A']

-0.8294117252329944

### For getting fast access to a scalar (equivalent to prior method)

In [24]:
df.at[dates[0],'A']

-0.8294117252329944

## *Selection by Position*

### Select via the position of the passed integers

In [25]:
df.iloc[3]

A   -0.212901
B   -0.676578
C   -2.105190
D    0.928769
Name: 2013-01-04 00:00:00, dtype: float64

### By integer slices, acting similar to numpy/python

In [26]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.212901 -0.676578
2013-01-05  0.598247 -0.833896

### By lists of integer position locations, similar to the numpy/python style

In [27]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.073559 -2.022051
2013-01-03  1.045010 -0.600271
2013-01-05  0.598247  0.392578

### For slicing rows explicitly

In [28]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -0.073559 -0.771695 -2.022051  0.744386
2013-01-03  1.045010 -0.777690 -0.600271 -0.670022

### For slicing columns explicitly

In [29]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.488830  1.034144
2013-01-02 -0.771695 -2.022051
2013-01-03 -0.777690 -0.600271
2013-01-04 -0.676578 -2.105190
2013-01-05 -0.833896  0.392578
2013-01-06 -1.213800  1.011491

### For getting a value explicitly

In [30]:
df.iloc[1,1]

-0.7716949303733139

### For getting faster access to scalar (eqiuivalent to prior method)

In [31]:
df.iat[1,1]

-0.7716949303733139

## *Boolean Indexing*

### Using a single column's values to select data

In [32]:
df[df.A>0]

                   A         B         C         D
2013-01-03  1.045010 -0.777690 -0.600271 -0.670022
2013-01-05  0.598247 -0.833896  0.392578  0.683457
2013-01-06  0.375194 -1.213800  1.011491 -0.077752

### A where operation for getting

In [33]:
df[df>0]

                   A   B         C         D
2013-01-01       NaN NaN  1.034144  1.179797
2013-01-02       NaN NaN       NaN  0.744386
2013-01-03  1.045010 NaN       NaN       NaN
2013-01-04       NaN NaN       NaN  0.928769
2013-01-05  0.598247 NaN  0.392578  0.683457
2013-01-06  0.375194 NaN  1.011491       NaN

### Using isin() method for filtering

In [34]:
df2 = df.copy()

df2['E'] =  ['one', 'one', 'two', 'three', 'four', 'three']

df2

                   A         B         C         D      E
2013-01-01 -0.829412 -0.488830  1.034144  1.179797    one
2013-01-02 -0.073559 -0.771695 -2.022051  0.744386    one
2013-01-03  1.045010 -0.777690 -0.600271 -0.670022    two
2013-01-04 -0.212901 -0.676578 -2.105190  0.928769  three
2013-01-05  0.598247 -0.833896  0.392578  0.683457   four
2013-01-06  0.375194 -1.213800  1.011491 -0.077752  three

In [35]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  1.045010 -0.777690 -0.600271 -0.670022   two
2013-01-05  0.598247 -0.833896  0.392578  0.683457  four

## *Setting*

### Setting a new column

In [36]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

### Setting values by label

In [37]:
df.at[dates[0],'A'] = 0

### Setting values by position

In [38]:
df.iat[0,1] = 0

### Setting by assigning with a numpy array

In [39]:
df.loc[:,'D'] = np.array([5] * len(df))

### Result

In [40]:
df

                   A         B         C  D
2013-01-01  0.000000  0.000000  1.034144  5
2013-01-02 -0.073559 -0.771695 -2.022051  5
2013-01-03  1.045010 -0.777690 -0.600271  5
2013-01-04 -0.212901 -0.676578 -2.105190  5
2013-01-05  0.598247 -0.833896  0.392578  5
2013-01-06  0.375194 -1.213800  1.011491  5

### A where operation with setting

In [41]:
df2 = df.copy()

df2[df2>0] = -df2

df2

                   A         B         C  D
2013-01-01  0.000000  0.000000 -1.034144 -5
2013-01-02 -0.073559 -0.771695 -2.022051 -5
2013-01-03 -1.045010 -0.777690 -0.600271 -5
2013-01-04 -0.212901 -0.676578 -2.105190 -5
2013-01-05 -0.598247 -0.833896 -0.392578 -5
2013-01-06 -0.375194 -1.213800 -1.011491 -5

## **MISSING DATA**

### Reindexing

In [42]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

df1.loc[dates[0]:dates[1],'E'] = 1

df1

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  1.034144  5  1.0
2013-01-02 -0.073559 -0.771695 -2.022051  5  1.0
2013-01-03  1.045010 -0.777690 -0.600271  5  NaN
2013-01-04 -0.212901 -0.676578 -2.105190  5  NaN

### To drop any rows that have missing data

In [43]:
df1.dropna(how='any')

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  1.034144  5  1.0
2013-01-02 -0.073559 -0.771695 -2.022051  5  1.0

### Filling missing data

In [44]:
df1.fillna(value=5)

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  1.034144  5  1.0
2013-01-02 -0.073559 -0.771695 -2.022051  5  1.0
2013-01-03  1.045010 -0.777690 -0.600271  5  5.0
2013-01-04 -0.212901 -0.676578 -2.105190  5  5.0

### To get the boolean mask where the values are nan

In [45]:
pd.isnull(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

## **OPERATIONS**

### *Stats*

### Performing a descriptive statistics

In [46]:
df.mean()

A    0.288665
B   -0.712276
C   -0.381550
D    5.000000
dtype: float64

### Same operation on the other axis

In [47]:
df.mean(1)

2013-01-01    1.508536
2013-01-02    0.533174
2013-01-03    1.166762
2013-01-04    0.501333
2013-01-05    1.289232
2013-01-06    1.293221
Freq: D, dtype: float64

### Operating with objects that have different dimensionality and need alignment

In [48]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [49]:
df.sub(s, axis='index')

                   A         B         C    D
2013-01-01       NaN       NaN       NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN
2013-01-03  0.045010 -1.777690 -1.600271  4.0
2013-01-04 -3.212901 -3.676578 -5.105190  2.0
2013-01-05 -4.401753 -5.833896 -4.607422  0.0
2013-01-06       NaN       NaN       NaN  NaN

## *Apply*

### Applying functions to the data

In [50]:
df.apply(np.cumsum)

                   A         B         C   D
2013-01-01  0.000000  0.000000  1.034144   5
2013-01-02 -0.073559 -0.771695 -0.987907  10
2013-01-03  0.971451 -1.549385 -1.588179  15
2013-01-04  0.758550 -2.225962 -3.693369  20
2013-01-05  1.356797 -3.059859 -3.300791  25
2013-01-06  1.731992 -4.273659 -2.289300  30

In [51]:
df.apply(lambda x: x.max() - x.min())

A    1.257911
B    1.213800
C    3.139334
D    0.000000
dtype: float64

## *Histogramming*

In [52]:
s = pd.Series(np.random.randint(0,7, size=10))
s

0    2
1    5
2    5
3    4
4    4
5    4
6    2
7    3
8    2
9    3
dtype: int64

In [53]:
s.value_counts()

4    3
2    3
5    2
3    2
dtype: int64

## *String Methods*

In [54]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

## **MERGE**

### *Concat*

In [55]:
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0 -1.178651 -2.031346 -1.306926 -0.333855
1  0.164350  0.217476  0.601882  0.124325
2 -0.641255  0.241066  0.335698 -0.400189
3 -0.866013 -0.475853 -0.015119  0.714550
4 -0.627227  0.278282  1.615337  0.661497
5  1.876886 -0.913291 -0.034276 -0.212439
6 -1.712025  1.971149 -0.622699 -0.414462
7  0.964809 -2.247935  1.073705  0.302916
8 -0.824213  0.836697 -0.315215  0.909169
9  0.551480  1.457134 -0.727525  1.128725

In [56]:
pieces = [df[:3], df[3:7], df[7:]]
pd.concat(pieces)

          0         1         2         3
0 -1.178651 -2.031346 -1.306926 -0.333855
1  0.164350  0.217476  0.601882  0.124325
2 -0.641255  0.241066  0.335698 -0.400189
3 -0.866013 -0.475853 -0.015119  0.714550
4 -0.627227  0.278282  1.615337  0.661497
5  1.876886 -0.913291 -0.034276 -0.212439
6 -1.712025  1.971149 -0.622699 -0.414462
7  0.964809 -2.247935  1.073705  0.302916
8 -0.824213  0.836697 -0.315215  0.909169
9  0.551480  1.457134 -0.727525  1.128725

### *Join*

In [57]:
left = pd.DataFrame({'key':['foo','foo'], 'lval':[1,2]})
right = pd.DataFrame({'key':['foo','foo'], 'rval':[4,5]})

In [58]:
left

   key  lval
0  foo     1
1  foo     2

In [59]:
right

   key  rval
0  foo     4
1  foo     5

In [60]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

### *Append*

In [61]:
df = pd.DataFrame(np.random.randn(8,4), columns=['A','B','C','D'])
df

          A         B         C         D
0  0.141680 -1.990807  0.639048 -1.118292
1 -2.442503  0.070313 -0.221877 -0.104972
2  0.116883 -0.074926 -1.404534 -1.827425
3  0.046640 -0.699324 -1.246270  1.236885
4  0.878535 -0.003019  1.511794  0.634624
5  1.294715  0.423243  0.280806 -1.199177
6 -0.893244 -0.721728  1.004806  1.169578
7 -0.259868  0.383375  1.762316  0.335046

In [62]:
s = df.iloc[3]

df.append(s, ignore_index=True)

          A         B         C         D
0  0.141680 -1.990807  0.639048 -1.118292
1 -2.442503  0.070313 -0.221877 -0.104972
2  0.116883 -0.074926 -1.404534 -1.827425
3  0.046640 -0.699324 -1.246270  1.236885
4  0.878535 -0.003019  1.511794  0.634624
5  1.294715  0.423243  0.280806 -1.199177
6 -0.893244 -0.721728  1.004806  1.169578
7 -0.259868  0.383375  1.762316  0.335046
8  0.046640 -0.699324 -1.246270  1.236885

## **GROUPING**

### Group by

In [63]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two','three',
                          'two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})

df

     A      B         C         D
0  foo    one -0.605381 -0.687574
1  bar    one -0.199032 -0.401901
2  foo    two  0.147487  1.598480
3  bar  three -1.477255 -0.734532
4  foo    two  0.547967  0.522719
5  bar    two -0.607375 -0.261268
6  foo    one -0.933223  1.059173
7  foo  three -0.473290 -0.354589

### Grouping and then applying a function sum to the resulting groups

In [64]:
df.groupby('A').sum()

            C         D
A
bar -2.283662 -1.397702
foo -1.316440  2.138209

### Grouping by multiple columns forms a heirarchial index, which we then apply the function

In [65]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -0.199032 -0.401901
    three -1.477255 -0.734532
    two   -0.607375 -0.261268
foo one   -1.538604  0.371599
    three -0.473290 -0.354589
    two    0.695454  2.121199

## **RESHAPING**

### *Stack*

In [66]:
tuples =  list(zip(*[['bar', 'bar', 'baz','baz',
                      'foo', 'foo', 'qux', 'qux'],
                     ['one', 'two', 'one', 'two',
                      'one', 'two', 'one', 'two']]))

index = pd.MultiIndex.from_tuples(tuples, names=['first','second'])

df = pd.DataFrame(np.random.randn(8,2), index=index, columns = ['A', 'B'])

df2 = df[:4]

df2

                     A         B
first second
bar   one     1.030210  0.991298
      two    -0.857347 -0.337735
baz   one     0.670464  1.668812
      two     0.086034 -1.157777

The stack() method compresses a level in the DataFrame's columns

In [67]:
stacked = df2.stack()

stacked

first  second
bar    one     A    1.030210
               B    0.991298
       two     A   -0.857347
               B   -0.337735
baz    one     A    0.670464
               B    1.668812
       two     A    0.086034
               B   -1.157777
dtype: float64

The unstack() method unstacks the last level

In [68]:
stacked.unstack()

                     A         B
first second
bar   one     1.030210  0.991298
      two    -0.857347 -0.337735
baz   one     0.670464  1.668812
      two     0.086034 -1.157777

In [69]:
stacked.unstack(1)

second        one       two
first
bar   A  1.030210 -0.857347
      B  0.991298 -0.337735
baz   A  0.670464  0.086034
      B  1.668812 -1.157777

In [70]:
stacked.unstack(0)

first          bar       baz
second
one    A  1.030210  0.670464
       B  0.991298  1.668812
two    A -0.857347  0.086034
       B -0.337735 -1.157777

### *Pivot Tables*

In [71]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                   'B' : ['A', 'B', 'C'] * 4,
                   'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2, 
                   'D' : np.random.randn(12),
                   'E' : np.random.randn(12)})

df

        A  B    C         D         E
0     one  A  foo  1.421947 -0.825026
1     one  B  foo  0.250550  0.346710
2     two  C  foo -1.214462  2.101152
3   three  A  bar  1.300670  0.971086
4     one  B  bar -0.048717  0.730157
5     one  C  bar  0.964168 -0.688027
6     two  A  foo  0.158957 -0.419299
7   three  B  foo -1.063710  2.044819
8     one  C  foo  0.882460  0.593111
9     one  A  bar  0.032861 -0.766347
10    two  B  bar  0.722271 -0.271056
11  three  C  bar  0.313004  0.786299

We can  produce pivot tables from this data very easily:

In [72]:
pd.pivot_table(df, values='D', index=['A','B'], columns=['C'])

C             bar       foo
A     B
one   A  0.032861  1.421947
      B -0.048717  0.250550
      C  0.964168  0.882460
three A  1.300670       NaN
      B       NaN -1.063710
      C  0.313004       NaN
two   A       NaN  0.158957
      B  0.722271       NaN
      C       NaN -1.214462

## **TIME SERIES**

In [73]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')

ts = pd.Series(np.random.randint(0,500,len(rng)), index=rng)

ts.resample('5Min').sum()

2012-01-01    27750
Freq: 5T, dtype: int64

### Time zone representation

In [74]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')

ts = pd.Series(np.random.randn(len(rng)), rng)

ts

2012-03-06   -0.849373
2012-03-07    0.724504
2012-03-08   -0.555614
2012-03-09   -0.046814
2012-03-10    0.373064
Freq: D, dtype: float64

In [75]:
ts_utc = ts.tz_localize('UTC')

ts_utc

2012-03-06 00:00:00+00:00   -0.849373
2012-03-07 00:00:00+00:00    0.724504
2012-03-08 00:00:00+00:00   -0.555614
2012-03-09 00:00:00+00:00   -0.046814
2012-03-10 00:00:00+00:00    0.373064
Freq: D, dtype: float64

### Convert to another time zone

In [76]:
ts_utc.tz_convert('US/Eastern')

2012-03-05 19:00:00-05:00   -0.849373
2012-03-06 19:00:00-05:00    0.724504
2012-03-07 19:00:00-05:00   -0.555614
2012-03-08 19:00:00-05:00   -0.046814
2012-03-09 19:00:00-05:00    0.373064
Freq: D, dtype: float64

### Converting between time span representations

In [77]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')

ts = pd.Series(np.random.randn(len(rng)), index=rng)

ts

2012-01-31    0.372115
2012-02-29    0.507033
2012-03-31   -0.244755
2012-04-30    2.681682
2012-05-31   -1.927510
Freq: M, dtype: float64

In [78]:
ps = ts.to_period()

ps

2012-01    0.372115
2012-02    0.507033
2012-03   -0.244755
2012-04    2.681682
2012-05   -1.927510
Freq: M, dtype: float64

In [79]:
ps.to_timestamp()

2012-01-01    0.372115
2012-02-01    0.507033
2012-03-01   -0.244755
2012-04-01    2.681682
2012-05-01   -1.927510
Freq: MS, dtype: float64

### Use of conversion:

In [80]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-Nov')

ts = pd.Series(np.random.randn(len(prng)), prng)

ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H','s') + 9

ts.head()

1990-03-01 09:00   -0.736161
1990-06-01 09:00   -2.022496
1990-09-01 09:00   -0.198655
1990-12-01 09:00   -0.611669
1991-03-01 09:00    0.335447
Freq: H, dtype: float64

## **CATEGORICALS**

In [81]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})

### Convert the grades to categrical data type

In [82]:
df["grade"] = df['raw_grade'].astype("category")

df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): ['a', 'b', 'e']

### Rename categories to more meaningful names (assigning to Series.cat.categories is in place)

In [83]:
df["grade"].cat.categories = ["very good", "good", "very bad"]

### Reorder the categories and simultaneously add the missing categories (methods under Series.cat return a new Series per default)

In [84]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])

df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): ['very bad', 'bad', 'medium', 'good', 'very good']

### Sorting is per order in the categories, not lexical order

In [85]:
df.sort_values(by="grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

### Grouping by a categorical column shows also empty categories

In [86]:
df.groupby("grade").size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64

## **GETTING DATA IN AND OUT**

### *CSV*

### Writing to csv file

In [87]:
df.to_csv('foo.csv')

### Reading from a CSV file

In [88]:
pd.read_csv('foo.csv')

   Unnamed: 0  id raw_grade      grade
0           0   1         a  very good
1           1   2         b       good
2           2   3         b       good
3           3   4         a  very good
4           4   5         a  very good
5           5   6         e   very bad

### *Excel*

### Writing to an excel file

In [89]:
df.to_excel('foo.xlsx', sheet_name='Sheet1')

### Reading from an excel file

In [90]:
pd.read_excel('foo.xlsx', 'Sheet1', index_col = None, na_values = ['NA'])

   Unnamed: 0  id raw_grade      grade
0           0   1         a  very good
1           1   2         b       good
2           2   3         b       good
3           3   4         a  very good
4           4   5         a  very good
5           5   6         e   very bad